chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
/******************** (C) COPYRIGHT 2014 STMicroelectronics ********************
* File Name          : LSM303AGR_ACC_driver.c
* Author             : MSH Application Team
* Version            : v1.00
* Date               : 28/Apr/2015
* Description        : LSM303AGR ACC driver source file
*
* Reviewed by: Armando Visconti
*-------------------------------------------------------------------------------
*
*
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* THIS SOFTWARE IS SPECIFICALLY DESIGNED FOR EXCLUSIVE USE WITH ST PARTS.
*
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "LSM303AGR_ACC_driver.h"
#include "stm32f4xx_hal.h"
#include "x_nucleo_iks01a1.h"
//#include "i2C_mems.h"												//[Example]

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
* Function Name		: LSM303AGR_ACC_ReadReg
* Description		: Generic Reading function. It must be fullfilled with either
*					: I2C or SPI reading functions
* Input				: Register Address
* Output			: Data REad
* Return			: None
*******************************************************************************/
u8_t LSM303AGR_ACC_ReadReg(u8_t Reg, u8_t* Data)
{

    //To be completed with either I2c or SPI reading function
    //i.e.: *Data = SPI_Mems_Read_Reg( Reg );
    if(!I2C_EXPBD_ReadData(Data, LSM303AGR_ACC_I2C_ADDRESS, Reg, 1))  //[Example]
        return MEMS_ERROR;                                                        //[Example]
    else                                                                        //[Example]
        return MEMS_SUCCESS;                                                      //[Example]
}

/*******************************************************************************
* Function Name		: LSM303AGR_ACC_WriteReg
* Description		: Generic Writing function. It must be fullfilled with either
*					: I2C or SPI writing function
* Input				: Register Address, Data to be written
* Output			: None
* Return			: None
*******************************************************************************/
u8_t LSM303AGR_ACC_WriteReg(u8_t Reg, u8_t Data)
{

    //To be completed with either I2c or SPI writing function
    //i.e.: SPI_Mems_Write_Reg(Reg, Data);
    I2C_EXPBD_WriteData(&Data,  LSM303AGR_ACC_I2C_ADDRESS,  Reg, 1);       //[Example]
    return MEMS_SUCCESS;                                                        //[Example]
}
/* Exported functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_x_data_avail
* Description    : Read 1DA
* Input          : Pointer to LSM303AGR_ACC_1DA_t
* Output         : Status of 1DA see LSM303AGR_ACC_1DA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_x_data_avail(LSM303AGR_ACC_1DA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_1DA_MASK; //mask
		*value = (LSM303AGR_ACC_1DA_t)((*value) & LSM303AGR_ACC_1DA_MASK);
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_y_data_avail
* Description    : Read 2DA_
* Input          : Pointer to LSM303AGR_ACC_2DA__t
* Output         : Status of 2DA_ see LSM303AGR_ACC_2DA__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_y_data_avail(LSM303AGR_ACC_2DA__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_2DA__MASK; //mask
    *value = (LSM303AGR_ACC_2DA__t)((*value) & LSM303AGR_ACC_2DA__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_z_data_avail
* Description    : Read 3DA_
* Input          : Pointer to LSM303AGR_ACC_3DA__t
* Output         : Status of 3DA_ see LSM303AGR_ACC_3DA__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_z_data_avail(LSM303AGR_ACC_3DA__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_3DA__MASK; //mask
    *value = (LSM303AGR_ACC_3DA__t)((*value) & LSM303AGR_ACC_3DA__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_xyz_data_avail
* Description    : Read 321DA_
* Input          : Pointer to LSM303AGR_ACC_321DA__t
* Output         : Status of 321DA_ see LSM303AGR_ACC_321DA__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_xyz_data_avail(LSM303AGR_ACC_321DA__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

