chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    //*value &= LSM303AGR_ACC_321DA__MASK; //mask
    *value = (LSM303AGR_ACC_321DA__t)((*value) & LSM303AGR_ACC_321DA__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_DataXOverrun
* Description    : Read 1OR_
* Input          : Pointer to LSM303AGR_ACC_1OR__t
* Output         : Status of 1OR_ see LSM303AGR_ACC_1OR__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_DataXOverrun(LSM303AGR_ACC_1OR__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_1OR__MASK; //mask
    *value = (LSM303AGR_ACC_1OR__t)((*value) & LSM303AGR_ACC_1OR__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_DataYOverrun
* Description    : Read 2OR_
* Input          : Pointer to LSM303AGR_ACC_2OR__t
* Output         : Status of 2OR_ see LSM303AGR_ACC_2OR__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_DataYOverrun(LSM303AGR_ACC_2OR__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_2OR__MASK; //mask
    *value = (LSM303AGR_ACC_2OR__t)((*value) & LSM303AGR_ACC_2OR__MASK); //mask		

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_DataZOverrun
* Description    : Read 3OR_
* Input          : Pointer to LSM303AGR_ACC_3OR__t
* Output         : Status of 3OR_ see LSM303AGR_ACC_3OR__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_DataZOverrun(LSM303AGR_ACC_3OR__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_3OR__MASK; //mask
    *value = (LSM303AGR_ACC_3OR__t)((*value) & LSM303AGR_ACC_3OR__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_DataXYZOverrun
* Description    : Read 321OR_
* Input          : Pointer to LSM303AGR_ACC_321OR__t
* Output         : Status of 321OR_ see LSM303AGR_ACC_321OR__t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_DataXYZOverrun(LSM303AGR_ACC_321OR__t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG_AUX, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_321OR__MASK; //mask
    *value = (LSM303AGR_ACC_321OR__t)((*value) & LSM303AGR_ACC_321OR__MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_int_counter
* Description    : Read IC
* Input          : Pointer to u8_t
* Output         : Status of IC
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_int_counter(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT_COUNTER_REG, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_IC_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_IC_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_WHO_AM_I
* Description    : Read WHO_AM_I
* Input          : Pointer to u8_t
* Output         : Status of WHO_AM_I
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_WHO_AM_I(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_WHO_AM_I_REG, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_WHO_AM_I_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_WHO_AM_I_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_TEMP_EN_bits
* Description    : Write TEMP_EN
* Input          : LSM303AGR_ACC_TEMP_EN_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_TEMP_EN_bits(LSM303AGR_ACC_TEMP_EN_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TEMP_CFG_REG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_TEMP_EN_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_TEMP_CFG_REG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_TEMP_EN_bits
* Description    : Read TEMP_EN
* Input          : Pointer to LSM303AGR_ACC_TEMP_EN_t
* Output         : Status of TEMP_EN see LSM303AGR_ACC_TEMP_EN_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_TEMP_EN_bits(LSM303AGR_ACC_TEMP_EN_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TEMP_CFG_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_TEMP_EN_MASK; //mask
    *value = (LSM303AGR_ACC_TEMP_EN_t)((*value) & LSM303AGR_ACC_TEMP_EN_MASK); //mask
		
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ADC_PD
* Description    : Write ADC_PD
* Input          : LSM303AGR_ACC_ADC_PD_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ADC_PD(LSM303AGR_ACC_ADC_PD_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TEMP_CFG_REG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_ADC_PD_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_TEMP_CFG_REG, value) )
        return MEMS_ERROR;

