chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
status_t LSM303AGR_ACC_R_LOWPWR_EN(LSM303AGR_ACC_LPEN_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG1, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_LPEN_MASK; //mask
		*value = (LSM303AGR_ACC_LPEN_t)((*value) & LSM303AGR_ACC_LPEN_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ODR
* Description    : Write ODR
* Input          : LSM303AGR_ACC_ODR_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ODR(LSM303AGR_ACC_ODR_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG1, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_ODR_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG1, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ODR
* Description    : Read ODR
* Input          : Pointer to LSM303AGR_ACC_ODR_t
* Output         : Status of ODR see LSM303AGR_ACC_ODR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ODR(LSM303AGR_ACC_ODR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG1, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ODR_MASK; //mask
		*value = (LSM303AGR_ACC_ODR_t)((*value) & LSM303AGR_ACC_ODR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_hpf_aoi_en_int1
* Description    : Write HPIS1
* Input          : LSM303AGR_ACC_HPIS1_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_hpf_aoi_en_int1(LSM303AGR_ACC_HPIS1_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_HPIS1_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG2, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_hpf_aoi_en_int1
* Description    : Read HPIS1
* Input          : Pointer to LSM303AGR_ACC_HPIS1_t
* Output         : Status of HPIS1 see LSM303AGR_ACC_HPIS1_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_hpf_aoi_en_int1(LSM303AGR_ACC_HPIS1_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_HPIS1_MASK; //mask
		*value = (LSM303AGR_ACC_HPIS1_t)((*value) & LSM303AGR_ACC_HPIS1_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_hpf_aoi_en_int2
* Description    : Write HPIS2
* Input          : LSM303AGR_ACC_HPIS2_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_hpf_aoi_en_int2(LSM303AGR_ACC_HPIS2_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_HPIS2_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG2, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_hpf_aoi_en_int2
* Description    : Read HPIS2
* Input          : Pointer to LSM303AGR_ACC_HPIS2_t
* Output         : Status of HPIS2 see LSM303AGR_ACC_HPIS2_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_hpf_aoi_en_int2(LSM303AGR_ACC_HPIS2_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_HPIS2_MASK; //mask
		*value = (LSM303AGR_ACC_HPIS2_t)((*value) & LSM303AGR_ACC_HPIS2_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_hpf_click_en
* Description    : Write HPCLICK
* Input          : LSM303AGR_ACC_HPCLICK_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_hpf_click_en(LSM303AGR_ACC_HPCLICK_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_HPCLICK_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG2, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_hpf_click_en
* Description    : Read HPCLICK
* Input          : Pointer to LSM303AGR_ACC_HPCLICK_t
* Output         : Status of HPCLICK see LSM303AGR_ACC_HPCLICK_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_hpf_click_en(LSM303AGR_ACC_HPCLICK_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_HPCLICK_MASK; //mask
		*value = (LSM303AGR_ACC_HPCLICK_t)(*value & LSM303AGR_ACC_HPCLICK_MASK);

