chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_I2_on_INT1
* Description    : Write I2_INT1
* Input          : LSM303AGR_ACC_I2_INT1_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_I2_on_INT1(LSM303AGR_ACC_I2_INT1_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG6, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_I2_INT1_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG6, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_I2_on_INT1
* Description    : Read I2_INT1
* Input          : Pointer to LSM303AGR_ACC_I2_INT1_t
* Output         : Status of I2_INT1 see LSM303AGR_ACC_I2_INT1_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_I2_on_INT1(LSM303AGR_ACC_I2_INT1_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG6, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_I2_INT1_MASK; //mask
    *value = (LSM303AGR_ACC_I2_INT1_t)((*value) & LSM303AGR_ACC_I2_INT1_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Click_on_INT2
* Description    : Write I2_CLICKEN
* Input          : LSM303AGR_ACC_I2_CLICKEN_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Click_on_INT2(LSM303AGR_ACC_I2_CLICKEN_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG6, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_I2_CLICKEN_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CTRL_REG6, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Click_on_INT2
* Description    : Read I2_CLICKEN
* Input          : Pointer to LSM303AGR_ACC_I2_CLICKEN_t
* Output         : Status of I2_CLICKEN see LSM303AGR_ACC_I2_CLICKEN_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Click_on_INT2(LSM303AGR_ACC_I2_CLICKEN_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CTRL_REG6, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_I2_CLICKEN_MASK; //mask
    *value = (LSM303AGR_ACC_I2_CLICKEN_t)((*value) & LSM303AGR_ACC_I2_CLICKEN_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ReferenceVal
* Description    : Write REF
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ReferenceVal(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_REF_POSITION; //mask
    newValue &= LSM303AGR_ACC_REF_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_REFERENCE, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_REF_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_REFERENCE, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ReferenceVal
* Description    : Read REF
* Input          : Pointer to u8_t
* Output         : Status of REF
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ReferenceVal(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_REFERENCE, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_REF_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_REF_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_XDataAvail
* Description    : Read XDA
* Input          : Pointer to LSM303AGR_ACC_XDA_t
* Output         : Status of XDA see LSM303AGR_ACC_XDA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_XDataAvail(LSM303AGR_ACC_XDA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_XDA_MASK; //mask
    *value = (LSM303AGR_ACC_XDA_t)((*value) & LSM303AGR_ACC_XDA_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_YDataAvail
* Description    : Read YDA
* Input          : Pointer to LSM303AGR_ACC_YDA_t
* Output         : Status of YDA see LSM303AGR_ACC_YDA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_YDataAvail(LSM303AGR_ACC_YDA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_YDA_MASK; //mask
    *value = (LSM303AGR_ACC_YDA_t)((*value) & LSM303AGR_ACC_YDA_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ZDataAvail
* Description    : Read ZDA
* Input          : Pointer to LSM303AGR_ACC_ZDA_t
* Output         : Status of ZDA see LSM303AGR_ACC_ZDA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ZDataAvail(LSM303AGR_ACC_ZDA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZDA_MASK; //mask
    *value = (LSM303AGR_ACC_ZDA_t)((*value) & LSM303AGR_ACC_ZDA_MASK);

