chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_XYZDataAvail
* Description    : Read ZYXDA
* Input          : Pointer to LSM303AGR_ACC_ZYXDA_t
* Output         : Status of ZYXDA see LSM303AGR_ACC_ZYXDA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_XYZDataAvail(LSM303AGR_ACC_ZYXDA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZYXDA_MASK; //mask
    *value = (LSM303AGR_ACC_ZYXDA_t)((*value) & LSM303AGR_ACC_ZYXDA_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_XDataOverrun
* Description    : Read XOR
* Input          : Pointer to LSM303AGR_ACC_XOR_t
* Output         : Status of XOR see LSM303AGR_ACC_XOR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_XDataOverrun(LSM303AGR_ACC_XOR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_XOR_MASK; //mask
    *value = (LSM303AGR_ACC_XOR_t)((*value) & LSM303AGR_ACC_XOR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_YDataOverrun
* Description    : Read YOR
* Input          : Pointer to LSM303AGR_ACC_YOR_t
* Output         : Status of YOR see LSM303AGR_ACC_YOR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_YDataOverrun(LSM303AGR_ACC_YOR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_YOR_MASK; //mask
    *value = (LSM303AGR_ACC_YOR_t)((*value) & LSM303AGR_ACC_YOR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ZDataOverrun
* Description    : Read ZOR
* Input          : Pointer to LSM303AGR_ACC_ZOR_t
* Output         : Status of ZOR see LSM303AGR_ACC_ZOR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ZDataOverrun(LSM303AGR_ACC_ZOR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZOR_MASK; //mask
    *value = (LSM303AGR_ACC_ZOR_t)((*value) & LSM303AGR_ACC_ZOR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_XYZDataOverrun
* Description    : Read ZYXOR
* Input          : Pointer to LSM303AGR_ACC_ZYXOR_t
* Output         : Status of ZYXOR see LSM303AGR_ACC_ZYXOR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_XYZDataOverrun(LSM303AGR_ACC_ZYXOR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_STATUS_REG2, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZYXOR_MASK; //mask
    *value = (LSM303AGR_ACC_ZYXOR_t)((*value) & LSM303AGR_ACC_ZYXOR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_FifoThreshold
* Description    : Write FTH
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_FifoThreshold(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_FTH_POSITION; //mask
    newValue &= LSM303AGR_ACC_FTH_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_FTH_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_FIFO_CTRL_REG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_FifoThreshold
* Description    : Read FTH
* Input          : Pointer to u8_t
* Output         : Status of FTH
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_FifoThreshold(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_FTH_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_FTH_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_TriggerSel
* Description    : Write TR
* Input          : LSM303AGR_ACC_TR_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_TriggerSel(LSM303AGR_ACC_TR_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_TR_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_FIFO_CTRL_REG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_TriggerSel
* Description    : Read TR
* Input          : Pointer to LSM303AGR_ACC_TR_t
* Output         : Status of TR see LSM303AGR_ACC_TR_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

