chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
status_t LSM303AGR_ACC_R_TriggerSel(LSM303AGR_ACC_TR_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_TR_MASK; //mask
		*value = (LSM303AGR_ACC_TR_t)((*value) & LSM303AGR_ACC_TR_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_FifoMode
* Description    : Write FM
* Input          : LSM303AGR_ACC_FM_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_FifoMode(LSM303AGR_ACC_FM_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_FM_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_FIFO_CTRL_REG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_FifoMode
* Description    : Read FM
* Input          : Pointer to LSM303AGR_ACC_FM_t
* Output         : Status of FM see LSM303AGR_ACC_FM_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_FifoMode(LSM303AGR_ACC_FM_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_CTRL_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_FM_MASK; //mask
    *value = (LSM303AGR_ACC_FM_t)((*value) & LSM303AGR_ACC_FM_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_FifoSamplesAvail
* Description    : Read FSS
* Input          : Pointer to u8_t
* Output         : Status of FSS
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_FifoSamplesAvail(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_SRC_REG, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_FSS_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_FSS_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_FifoEmpty
* Description    : Read EMPTY
* Input          : Pointer to LSM303AGR_ACC_EMPTY_t
* Output         : Status of EMPTY see LSM303AGR_ACC_EMPTY_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_FifoEmpty(LSM303AGR_ACC_EMPTY_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_SRC_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_EMPTY_MASK; //mask
    *value = (LSM303AGR_ACC_EMPTY_t)((*value) & LSM303AGR_ACC_EMPTY_MASK);
    *value = (LSM303AGR_ACC_EMPTY_t)(*value >> LSM303AGR_ACC_FSS_POSITION); //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_FifoOverrun
* Description    : Read OVRN_FIFO
* Input          : Pointer to LSM303AGR_ACC_OVRN_FIFO_t
* Output         : Status of OVRN_FIFO see LSM303AGR_ACC_OVRN_FIFO_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_FifoOverrun(LSM303AGR_ACC_OVRN_FIFO_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_SRC_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_OVRN_FIFO_MASK; //mask
    *value = (LSM303AGR_ACC_OVRN_FIFO_t)((*value) & LSM303AGR_ACC_OVRN_FIFO_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_WatermarkLevel
* Description    : Read WTM
* Input          : Pointer to LSM303AGR_ACC_WTM_t
* Output         : Status of WTM see LSM303AGR_ACC_WTM_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_WatermarkLevel(LSM303AGR_ACC_WTM_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_FIFO_SRC_REG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_WTM_MASK; //mask
    *value = (LSM303AGR_ACC_WTM_t)((*value) & LSM303AGR_ACC_WTM_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Int1EnXLo
* Description    : Write XLIE
* Input          : LSM303AGR_ACC_XLIE_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Int1EnXLo(LSM303AGR_ACC_XLIE_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_CFG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_XLIE_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_INT1_CFG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int1EnXLo
* Description    : Read XLIE
* Input          : Pointer to LSM303AGR_ACC_XLIE_t
* Output         : Status of XLIE see LSM303AGR_ACC_XLIE_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int1EnXLo(LSM303AGR_ACC_XLIE_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_CFG, (u8_t *)value) )
        return MEMS_ERROR;

