chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int1_IA
* Description    : Read IA
* Input          : Pointer to LSM303AGR_ACC_IA_t
* Output         : Status of IA see LSM303AGR_ACC_IA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int1_IA(LSM303AGR_ACC_IA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_IA_MASK; //mask
		*value = (LSM303AGR_ACC_IA_t)((*value) & LSM303AGR_ACC_IA_MASK);

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_Xlo
* Description    : Read XL
* Input          : Pointer to LSM303AGR_ACC_XL_t
* Output         : Status of XL see LSM303AGR_ACC_XL_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_Xlo(LSM303AGR_ACC_XL_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_XL_MASK; //mask
		*value = (LSM303AGR_ACC_XL_t)((*value) & LSM303AGR_ACC_XL_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_XHi
* Description    : Read XH
* Input          : Pointer to LSM303AGR_ACC_XH_t
* Output         : Status of XH see LSM303AGR_ACC_XH_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_XHi(LSM303AGR_ACC_XH_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_XH_MASK; //mask
		*value = (LSM303AGR_ACC_XH_t)((*value) & LSM303AGR_ACC_XH_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_YLo
* Description    : Read YL
* Input          : Pointer to LSM303AGR_ACC_YL_t
* Output         : Status of YL see LSM303AGR_ACC_YL_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_YLo(LSM303AGR_ACC_YL_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_YL_MASK; //mask
		*value = (LSM303AGR_ACC_YL_t)((*value) & LSM303AGR_ACC_YL_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_YHi
* Description    : Read YH
* Input          : Pointer to LSM303AGR_ACC_YH_t
* Output         : Status of YH see LSM303AGR_ACC_YH_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_YHi(LSM303AGR_ACC_YH_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_YH_MASK; //mask
		*value = (LSM303AGR_ACC_YH_t)((*value) & LSM303AGR_ACC_YH_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_Zlo
* Description    : Read ZL
* Input          : Pointer to LSM303AGR_ACC_ZL_t
* Output         : Status of ZL see LSM303AGR_ACC_ZL_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_Zlo(LSM303AGR_ACC_ZL_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZL_MASK; //mask
		*value = (LSM303AGR_ACC_ZL_t)((*value) & LSM303AGR_ACC_ZL_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_ZHi
* Description    : Read ZH
* Input          : Pointer to LSM303AGR_ACC_ZH_t
* Output         : Status of ZH see LSM303AGR_ACC_ZH_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_ZHi(LSM303AGR_ACC_ZH_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZH_MASK; //mask
		*value = (LSM303AGR_ACC_ZH_t)((*value) & LSM303AGR_ACC_ZH_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_IA
* Description    : Read IA
* Input          : Pointer to LSM303AGR_ACC_IA_t
* Output         : Status of IA see LSM303AGR_ACC_IA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_IA(LSM303AGR_ACC_IA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_SOURCE, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_IA_MASK; //mask
		*value = (LSM303AGR_ACC_IA_t)((*value) & LSM303AGR_ACC_IA_MASK);

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Int1_Threshold
* Description    : Write THS
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Int1_Threshold(u8_t newValue)
{
    u8_t value;

