chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    newValue = newValue << LSM303AGR_ACC_THS_POSITION; //mask
    newValue &= LSM303AGR_ACC_THS_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_THS, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_THS_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_INT1_THS, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int1_Threshold
* Description    : Read THS
* Input          : Pointer to u8_t
* Output         : Status of THS
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int1_Threshold(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_THS, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_THS_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_THS_POSITION; //mask

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Int2_Threshold
* Description    : Write THS
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Int2_Threshold(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_THS_POSITION; //mask
    newValue &= LSM303AGR_ACC_THS_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_THS, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_THS_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_INT2_THS, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_Threshold
* Description    : Read THS
* Input          : Pointer to u8_t
* Output         : Status of THS
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_Threshold(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_THS, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_THS_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_THS_POSITION; //mask

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Int1_Duration
* Description    : Write D
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Int1_Duration(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_D_POSITION; //mask
    newValue &= LSM303AGR_ACC_D_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_DURATION, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_D_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_INT1_DURATION, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int1_Duration
* Description    : Read D
* Input          : Pointer to u8_t
* Output         : Status of D
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int1_Duration(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT1_DURATION, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_D_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_D_POSITION; //mask

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_Int2_Duration
* Description    : Write D
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_Int2_Duration(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_D_POSITION; //mask
    newValue &= LSM303AGR_ACC_D_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_DURATION, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_D_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_INT2_DURATION, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_Int2_Duration
* Description    : Read D
* Input          : Pointer to u8_t
* Output         : Status of D
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_Int2_Duration(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_INT2_DURATION, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_D_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_D_POSITION; //mask

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_XSingle
* Description    : Write XS
* Input          : LSM303AGR_ACC_XS_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_XSingle(LSM303AGR_ACC_XS_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_CFG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_XS_MASK;
    value |= newValue;

