chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
status_t LSM303AGR_ACC_R_ZSingle(LSM303AGR_ACC_ZS_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_CFG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZS_MASK; //mask
		*value = (LSM303AGR_ACC_ZS_t)((*value) & LSM303AGR_ACC_ZS_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ZDouble
* Description    : Write ZD
* Input          : LSM303AGR_ACC_ZD_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ZDouble(LSM303AGR_ACC_ZD_t newValue)
{
    u8_t value;

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_CFG, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_ZD_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CLICK_CFG, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ZDouble
* Description    : Read ZD
* Input          : Pointer to LSM303AGR_ACC_ZD_t
* Output         : Status of ZD see LSM303AGR_ACC_ZD_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ZDouble(LSM303AGR_ACC_ZD_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_CFG, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_ZD_MASK; //mask
		*value = (LSM303AGR_ACC_ZD_t)((*value) & LSM303AGR_ACC_ZD_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickX
* Description    : Read X
* Input          : Pointer to LSM303AGR_ACC_X_t
* Output         : Status of X see LSM303AGR_ACC_X_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickX(LSM303AGR_ACC_X_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_X_MASK; //mask
		*value = (LSM303AGR_ACC_X_t)((*value) & LSM303AGR_ACC_X_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickY
* Description    : Read Y
* Input          : Pointer to LSM303AGR_ACC_Y_t
* Output         : Status of Y see LSM303AGR_ACC_Y_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickY(LSM303AGR_ACC_Y_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_Y_MASK; //mask
		*value = (LSM303AGR_ACC_Y_t)((*value) & LSM303AGR_ACC_Y_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickZ
* Description    : Read Z
* Input          : Pointer to LSM303AGR_ACC_Z_t
* Output         : Status of Z see LSM303AGR_ACC_Z_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickZ(LSM303AGR_ACC_Z_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_Z_MASK; //mask
		*value = (LSM303AGR_ACC_Z_t)((*value) & LSM303AGR_ACC_Z_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickSign
* Description    : Read SIGN
* Input          : Pointer to LSM303AGR_ACC_SIGN_t
* Output         : Status of SIGN see LSM303AGR_ACC_SIGN_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickSign(LSM303AGR_ACC_SIGN_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_SIGN_MASK; //mask
		*value = (LSM303AGR_ACC_SIGN_t)((*value) & LSM303AGR_ACC_SIGN_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_SingleCLICK
* Description    : Read SCLICK
* Input          : Pointer to LSM303AGR_ACC_SCLICK_t
* Output         : Status of SCLICK see LSM303AGR_ACC_SCLICK_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_SingleCLICK(LSM303AGR_ACC_SCLICK_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_SCLICK_MASK; //mask
		*value = (LSM303AGR_ACC_SCLICK_t)((*value) & LSM303AGR_ACC_SCLICK_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_DoubleCLICK
* Description    : Read DCLICK
* Input          : Pointer to LSM303AGR_ACC_DCLICK_t
* Output         : Status of DCLICK see LSM303AGR_ACC_DCLICK_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_DoubleCLICK(LSM303AGR_ACC_DCLICK_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_DCLICK_MASK; //mask
		*value = (LSM303AGR_ACC_DCLICK_t)((*value) & LSM303AGR_ACC_DCLICK_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_IA
* Description    : Read IA
* Input          : Pointer to LSM303AGR_ACC_IA_t
* Output         : Status of IA see LSM303AGR_ACC_IA_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

