chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
status_t LSM303AGR_ACC_R_CLICK_IA(LSM303AGR_ACC_CLICK_IA_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_SRC, (u8_t *)value) )
        return MEMS_ERROR;

    //*value &= LSM303AGR_ACC_IA_MASK; //mask
		*value = (LSM303AGR_ACC_CLICK_IA_t)((*value) & LSM303AGR_ACC_IA_MASK);

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ClickThreshold
* Description    : Write THS
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ClickThreshold(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_THS_POSITION; //mask
    newValue &= LSM303AGR_ACC_THS_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_THS, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_THS_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_CLICK_THS, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickThreshold
* Description    : Read THS
* Input          : Pointer to u8_t
* Output         : Status of THS
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickThreshold(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_CLICK_THS, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_THS_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_THS_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ClickTimeLimit
* Description    : Write TLI
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ClickTimeLimit(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_TLI_POSITION; //mask
    newValue &= LSM303AGR_ACC_TLI_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_LIMIT, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_TLI_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_TIME_LIMIT, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickTimeLimit
* Description    : Read TLI
* Input          : Pointer to u8_t
* Output         : Status of TLI
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickTimeLimit(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_LIMIT, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_TLI_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_TLI_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ClickTimeLatency
* Description    : Write TLA
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ClickTimeLatency(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_TLA_POSITION; //mask
    newValue &= LSM303AGR_ACC_TLA_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_LATENCY, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_TLA_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_TIME_LATENCY, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickTimeLatency
* Description    : Read TLA
* Input          : Pointer to u8_t
* Output         : Status of TLA
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickTimeLatency(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_LATENCY, (u8_t *)value) )
        return MEMS_ERROR;

    *value &= LSM303AGR_ACC_TLA_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_TLA_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM303AGR_ACC_W_ClickTimeWindow
* Description    : Write TW
* Input          : u8_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM303AGR_ACC_W_ClickTimeWindow(u8_t newValue)
{
    u8_t value;

    newValue = newValue << LSM303AGR_ACC_TW_POSITION; //mask
    newValue &= LSM303AGR_ACC_TW_MASK; //coerce

    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_WINDOW, &value) )
        return MEMS_ERROR;

    value &= ~LSM303AGR_ACC_TW_MASK;
    value |= newValue;

    if( HAL_OK!=LSM303AGR_ACC_WriteReg(LSM303AGR_ACC_TIME_WINDOW, value) )
        return MEMS_ERROR;

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM303AGR_ACC_R_ClickTimeWindow
* Description    : Read TW
* Input          : Pointer to u8_t
* Output         : Status of TW
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM303AGR_ACC_R_ClickTimeWindow(u8_t *value)
{
    if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_TIME_WINDOW, (u8_t *)value) )
        return MEMS_ERROR;

