chaichenluo/STM32_Platform/system/drivers/st/lsm303agr/LSM303AGR_ACC_driver.c
    *value &= LSM303AGR_ACC_TW_MASK; //coerce
    *value = *value >> LSM303AGR_ACC_TW_POSITION; //mask

    return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : status_t LSM303AGR_ACC_Get_Voltage_ADC(u8_t *buff)
* Description    : Read Voltage_ADC output register
* Input          : pointer to [u8_t]
* Output         : Voltage_ADC buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM303AGR_ACC_Get_Voltage_ADC(u8_t *buff)
{
    u8_t i, j, k;
    u8_t numberOfByteForDimension;

    numberOfByteForDimension=6/3;

    k=0;
    for (i=0; i<3; i++ )
    {
        for (j=0; j<numberOfByteForDimension; j++ )
        {
            if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_OUT_ADC1_L+k, &buff[k]))
                return MEMS_ERROR;
            k++;
        }
    }

    return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : status_t LSM303AGR_ACC_Get_Raw_Acceleration(u8_t *buff)
* Description    : Read Acceleration output register
* Input          : pointer to [u8_t]
* Output         : Acceleration buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM303AGR_ACC_Get_Raw_Acceleration(u8_t *buff)
{
    u8_t i, j, k;
    u8_t numberOfByteForDimension;

    numberOfByteForDimension=6/3;

    k=0;
    for (i=0; i<3; i++ )
    {
        for (j=0; j<numberOfByteForDimension; j++ )
        {
            if( HAL_OK!=LSM303AGR_ACC_ReadReg(LSM303AGR_ACC_OUT_X_L+k, &buff[k]))
                return MEMS_ERROR;
            k++;
        }
    }

    return MEMS_SUCCESS;
}

/*
 * Following is the table of sensitivity values for each case.
 * Values are espressed in ug/digit.
 */
const long long LSM303AGR_ACC_Sensitivity_List[3][4] = {
    /* HR 12-bit */
    {
        980,	/* FS @2g */
        1950,	/* FS @4g */
        3900,	/* FS @8g */
        11720,	/* FS @16g */
    },

    /* Normal 10-bit */
    {
        3900,	/* FS @2g */
        7820,	/* FS @4g */
        15630,	/* FS @8g */
        46900,	/* FS @16g */
    },

    /* LP 8-bit */
    {
        15630,	/* FS @2g */
        31260,	/* FS @4g */
        62520,	/* FS @8g */
        187580,	/* FS @16g */
    },
};

/*
 * Values returned are espressed in mg.
 */
status_t LSM303AGR_ACC_Get_Acceleration(int *buff)
{
    Type3Axis16bit_U raw_data_tmp;
    u8_t op_mode = 0, fs_mode = 0, shift = 0;
    LSM303AGR_ACC_LPEN_t lp;
    LSM303AGR_ACC_HR_t hr;
    LSM303AGR_ACC_FS_t fs;

    /* Determine which operational mode the acc is set */
    LSM303AGR_ACC_R_HiRes(&hr);
    LSM303AGR_ACC_R_LOWPWR_EN(&lp);

    if (lp == LSM303AGR_ACC_LPEN_ENABLED && hr == LSM303AGR_ACC_HR_DISABLED) {
        /* op mode is LP 8-bit */
        op_mode = 2;
        shift = 8;
    } else if (lp == LSM303AGR_ACC_LPEN_DISABLED && hr == LSM303AGR_ACC_HR_DISABLED) {
        /* op mode is Normal 10-bit */
        op_mode = 1;
        shift = 6;
    } else if (lp == LSM303AGR_ACC_LPEN_DISABLED && hr == LSM303AGR_ACC_HR_ENABLED) {
        /* op mode is HR 12-bit */
        op_mode = 0;
        shift = 4;
    } else
        return MEMS_ERROR;

    /* Determine the Full Scale the acc is set */
    LSM303AGR_ACC_R_FullScale(&fs);
    switch (fs) {
    case LSM303AGR_ACC_FS_2G:
        fs_mode = 0;
        break;

    case LSM303AGR_ACC_FS_4G:
        fs_mode = 1;
        break;

    case LSM303AGR_ACC_FS_8G:
        fs_mode = 2;
        break;

    case LSM303AGR_ACC_FS_16G:
        fs_mode = 3;
        break;
    }

    /* Read out raw accelerometer samples */
    LSM303AGR_ACC_Get_Raw_Acceleration(raw_data_tmp.u8bit);

    /* Apply proper shift and sensitivity */
    buff[0] = ((raw_data_tmp.i16bit[0] >> shift) * LSM303AGR_ACC_Sensitivity_List[op_mode][fs_mode] + 500) / 1000;
    buff[1] = ((raw_data_tmp.i16bit[1] >> shift) * LSM303AGR_ACC_Sensitivity_List[op_mode][fs_mode] + 500) / 1000;
    buff[2] = ((raw_data_tmp.i16bit[2] >> shift) * LSM303AGR_ACC_Sensitivity_List[op_mode][fs_mode] + 500) / 1000;

    return MEMS_SUCCESS;
}
